# DPartReinfDeletedEditDivision Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..DPartReinfDeletedEditDivision Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Edits to the model will cause some Reinforcement hosted on Parts to be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DPartReinfDeletedEditDivision { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DPartReinfDeletedEditDivision As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DPartReinfDeletedEditDivision {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace